MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR7</name><description>Port output data (y =               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR6</name><description>Port output data (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR5</name><description>Port output data (y =               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR4</name><description>Port output data (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR3</name><description>Port output data (y =               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR2</name><description>Port output data (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR1</name><description>Port output data (y =               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR0</name><description>Port output data (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BSRR</name><displayName>BSRR</displayName><description>GPIO port bit set/reset           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>BR15</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>BR0</name><description>Port x set bit y (y=               0..15)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>BS15</name><description>Port x set bit y (y=               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BS14</name><description>Port x set bit y (y=               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BS13</name><description>Port x set bit y (y=               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BS12</name><description>Port x set bit y (y=               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BS11</name><description>Port x set bit y (y=               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BS10</name><description>Port x set bit y (y=               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BS9</name><description>Port x set bit y (y=               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BS8</name><description>Port x set bit y (y=               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BS7</name><description>Port x set bit y (y=               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BS6</name><description>Port x set bit y (y=               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BS5</name><description>Port x set bit y (y=               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BS4</name><description>Port x set bit y (y=               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BS3</name><description>Port x set bit y (y=               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BS2</name><description>Port x set bit y (y=               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BS1</name><description>Port x set bit y (y=               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BS0</name><description>Port x set bit y (y=               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>LCKR</name><displayName>LCKR</displayName><description>GPIO port configuration lock           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LCKK</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK15</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK14</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK13</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK12</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK11</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK10</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK9</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK8</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK7</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK6</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK5</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK4</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK3</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK2</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK1</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK0</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AFRL</name><displayName>AFRL</displayName><description>GPIO alternate function low           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AFRL7</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL6</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL5</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL4</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL3</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL2</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL1</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL0</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>AFRH</name><displayName>AFRH</displayName><description>GPIO alternate function high           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AFRH15</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH14</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH13</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH12</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH11</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH10</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH9</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH8</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>BRR</name><displayName>BRR</displayName><description>Port bit reset register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>BR0</name><description>Port x Reset bit y</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Port x Reset bit y</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Port x Reset bit y</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Port x Reset bit y</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Port x Reset bit y</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Port x Reset bit y</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Port x Reset bit y</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Port x Reset bit y</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Port x Reset bit y</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Port x Reset bit y</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Port x Reset bit y</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Port x Reset bit y</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Port x Reset bit y</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Port x Reset bit y</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Port x Reset bit y</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BR15</name><description>Port x Reset bit y</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>SPI1</name><description>Serial peripheral interface</description><groupName>SPI</groupName><baseAddress>0x40013000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>SPI1</name><description>SPI1_global_interrupt</description><value>25</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>BIDIMODE</name><description>Bidirectional data mode               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BIDIOE</name><description>Output enable in bidirectional               mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>Hardware CRC calculation               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCNEXT</name><description>CRC transfer next</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>DFF</name><description>Data frame format</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>RXONLY</name><description>Receive only</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SSM</name><description>Software slave management</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>SSI</name><description>Internal slave select</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LSBFIRST</name><description>Frame format</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SPE</name><description>SPI enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BR</name><description>Baud rate control</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>MSTR</name><description>Master selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>RXDMAEN</name><description>Rx buffer DMA enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TXDMAEN</name><description>Tx buffer DMA enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SSOE</name><description>SS output enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>NSSP</name><description>NSS pulse management</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FRF</name><description>Frame format</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNEIE</name><description>RX buffer not empty interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXEIE</name><description>Tx buffer empty interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>DS</name><description>Data size</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>FRXTH</name><description>FIFO reception threshold</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>LDMA_RX</name><description>Last DMA transfer for               reception</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>LDMA_TX</name><description>Last DMA transfer for               transmission</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x0002</resetValue><fields><field><name>RXNE</name><description>Receive buffer not empty</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXE</name><description>Transmit buffer empty</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CHSIDE</name><description>Channel side</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>UDR</name><description>Underrun flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CRCERR</name><description>CRC error flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MODF</name><description>Mode fault</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OVR</name><description>Overrun flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BSY</name><description>Busy flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TIFRFE</name><description>TI frame format error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FRLVL</name><description>FIFO reception level</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>FTLVL</name><description>FIFO transmission level</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>data register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DR</name><description>Data register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CRCPR</name><displayName>CRCPR</displayName><description>CRC polynomial register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0007</resetValue><fields><field><name>CRCPOLY</name><description>CRC polynomial register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>RXCRCR</name><displayName>RXCRCR</displayName><description>RX CRC register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>RxCRC</name><description>Rx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>TXCRCR</name><displayName>TXCRCR</displayName><description>TX CRC register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>TxCRC</name><description>Tx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>I2SCFGR</name><displayName>I2SCFGR</displayName><description>I2S configuration register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>I2SMOD</name><description>I2S mode selection</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SE</name><description>I2S Enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SCFG</name><description>I2S configuration mode</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>PCMSYNC</name><description>PCM frame synchronization</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SSTD</name><description>I2S standard selection</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>CKPOL</name><description>Steady state clock               polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DATLEN</name><description>Data length to be               transferred</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>CHLEN</name><description>Channel length (number of bits per audio               channel)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>I2SPR</name><displayName>I2SPR</displayName><description>I2S prescaler register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000010</resetValue><fields><field><name>MCKOE</name><description>Master clock output enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ODD</name><description>Odd factor for the               prescaler</description><bitOffse