MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
        interrupts</description><value>11</value></interrupt><registers><register><name>ISR</name><displayName>ISR</displayName><description>DMA interrupt status register           (DMA_ISR)</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>GIF1</name><description>Channel 1 Global interrupt               flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF1</name><description>Channel 1 Transfer Complete               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF1</name><description>Channel 1 Half Transfer Complete               flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF1</name><description>Channel 1 Transfer Error               flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF2</name><description>Channel 2 Global interrupt               flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF2</name><description>Channel 2 Transfer Complete               flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF2</name><description>Channel 2 Half Transfer Complete               flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF2</name><description>Channel 2 Transfer Error               flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF3</name><description>Channel 3 Global interrupt               flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF3</name><description>Channel 3 Transfer Complete               flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF3</name><description>Channel 3 Half Transfer Complete               flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF3</name><description>Channel 3 Transfer Error               flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF4</name><description>Channel 4 Global interrupt               flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF4</name><description>Channel 4 Transfer Complete               flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF4</name><description>Channel 4 Half Transfer Complete               flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF4</name><description>Channel 4 Transfer Error               flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF5</name><description>Channel 5 Global interrupt               flag</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF5</name><description>Channel 5 Transfer Complete               flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF5</name><description>Channel 5 Half Transfer Complete               flag</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF5</name><description>Channel 5 Transfer Error               flag</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF6</name><description>Channel 6 Global interrupt               flag</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF6</name><description>Channel 6 Transfer Complete               flag</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF6</name><description>Channel 6 Half Transfer Complete               flag</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF6</name><description>Channel 6 Transfer Error               flag</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF7</name><description>Channel 7 Global interrupt               flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF7</name><description>Channel 7 Transfer Complete               flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF7</name><description>Channel 7 Half Transfer Complete               flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF7</name><description>Channel 7 Transfer Error               flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IFCR</name><displayName>IFCR</displayName><description>DMA interrupt flag clear register           (DMA_IFCR)</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>CGIF1</name><description>Channel 1 Global interrupt               clear</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF1</name><description>Channel 1 Transfer Complete               clear</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF1</name><description>Channel 1 Half Transfer               clear</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF1</name><description>Channel 1 Transfer Error               clear</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF2</name><description>Channel 2 Global interrupt               clear</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF2</name><description>Channel 2 Transfer Complete               clear</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF2</name><description>Channel 2 Half Transfer               clear</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF2</name><description>Channel 2 Transfer Error               clear</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF3</name><description>Channel 3 Global interrupt               clear</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF3</name><description>Channel 3 Transfer Complete               clear</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF3</name><description>Channel 3 Half Transfer               clear</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF3</name><description>Channel 3 Transfer Error               clear</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF4</name><description>Channel 4 Global interrupt               clear</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF4</name><description>Channel 4 Transfer Complete               clear</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF4</name><description>Channel 4 Half Transfer               clear</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF4</name><description>Channel 4 Transfer Error               clear</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF5</name><description>Channel 5 Global interrupt               clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF5</name><description>Channel 5 Transfer Complete               clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF5</name><description>Channel 5 Half Transfer               clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF5</name><description>Channel 5 Transfer Error               clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF6</name><description>Channel 6 Global interrupt               clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF6</name><description>Channel 6 Transfer Complete               clear</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF6</name><description>Channel 6 Half Transfer               clear</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF6</name><description>Channel 6 Transfer Error               clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF7</name><description>Channel 7 Global interrupt               clear</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF7</name><description>Channel 7 Transfer Complete               clear</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF7</name><description>Channel 7 Half Transfer               clear</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF7</name><description>Channel 7 Transfer Error               clear</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR1</name><displayName>CCR1</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR1</name><displayName>CNDTR1</displayName><description>DMA channel 1 number of data           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR1</name><displayName>CPAR1</displayName><description>DMA channel 1 peripheral address           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR1</name><displayName>CMAR1</displayName><description>DMA channel 1 memory address           register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR2</name><displayName>CCR2</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR2</name><displayName>CNDTR2</displayName><description>DMA channel 2 number of data           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR2</name><displayName>CPAR2</displayName><description>DMA channel 2 peripheral address           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR2</name><displayName>CMAR2</displayName><description>DMA channel 2 memory address           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR3</name><displayName>CCR3</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR3</name><displayName>CNDTR3</displayName><description>DMA channel 3 number of data           register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR3</name><displayName>CPAR3</displayName><description>DMA channel 3 peripheral address           register</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR3</name><displayName>CMAR3</displayName><description>DMA channel 3 memory address           register</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR4</name><displayName>CCR4</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR4</name><displayName>CNDTR4</displayName><description>DMA channel 4 number of data           register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR4</name><displayName>CPAR4</displayName><description>DMA channel 4 peripheral address           register</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR4</name><displayName>CMAR4</displayName><description>DMA channel 4 memory address           register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR5</name><displayName>CCR5</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x58</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR5</name><displayName>CNDTR5</displayName><description>DMA channel 5 number of data           register</description><addressOffset>0x5C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR5</name><displayName>CPAR5</displayName><description>DMA channel 5 peripheral address           register</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></fi