MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
eld></fields></register><register><name>CMAR5</name><displayName>CMAR5</displayName><description>DMA channel 5 memory address           register</description><addressOffset>0x64</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR6</name><displayName>CCR6</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x6C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR6</name><displayName>CNDTR6</displayName><description>DMA channel 6 number of data           register</description><addressOffset>0x70</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR6</name><displayName>CPAR6</displayName><description>DMA channel 6 peripheral address           register</description><addressOffset>0x74</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR6</name><displayName>CMAR6</displayName><description>DMA channel 6 memory address           register</description><addressOffset>0x78</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR7</name><displayName>CCR7</displayName><description>DMA channel configuration register           (DMA_CCR)</description><addressOffset>0x80</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR7</name><displayName>CNDTR7</displayName><description>DMA channel 7 number of data           register</description><addressOffset>0x84</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR7</name><displayName>CPAR7</displayName><description>DMA channel 7 peripheral address           register</description><addressOffset>0x88</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR7</name><displayName>CMAR7</displayName><description>DMA channel 7 memory address           register</description><addressOffset>0x8C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>RCC</name><description>Reset and clock control</description><groupName>RCC</groupName><baseAddress>0x40021000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RCC_CRS</name><description>RCC and CRS global interrupts</description><value>4</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>Clock control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000083</resetValue><fields><field><name>HSION</name><description>Internal High Speed clock               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDY</name><description>Internal High Speed clock ready               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSITRIM</name><description>Internal High Speed clock               trimming</description><bitOffset>3</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>HSICAL</name><description>Internal High Speed clock               Calibration</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>HSEON</name><description>External High Speed clock               enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDY</name><description>External High Speed clock ready               flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSEBYP</name><description>External High Speed clock               Bypass</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSON</name><description>Clock Security System               enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLON</name><description>PLL enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDY</name><description>PLL clock ready flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CFGR</name><displayName>CFGR</displayName><description>Clock configuration register           (RCC_CFGR)</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>SW</name><description>System clock Switch</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SWS</name><description>System Clock Switch Status</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>HPRE</name><description>AHB prescaler</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PPRE</name><description>APB Low speed prescaler               (APB1)</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>ADCPRE</name><description>ADC prescaler</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLSRC</name><description>PLL input clock source</description><bitOffset>15</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PLLXTPRE</name><description>HSE divider for PLL entry</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLMUL</name><description>PLL Multiplication Factor</description><bitOffset>18</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>MCO</name><description>Microcontroller clock               output</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MCOPRE</name><description>Microcontroller Clock Output               Prescaler</description><bitOffset>28</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PLLNODIV</name><description>PLL clock not divided for               MCO</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CIR</name><displayName>CIR</displayName><description>Clock interrupt register           (RCC_CIR)</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>LSIRDYF</name><description>LSI Ready Interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSERDYF</name><description>LSE Ready Interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSIRDYF</name><description>HSI Ready Interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSERDYF</name><description>HSE Ready Interrupt flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLRDYF</name><description>PLL Ready Interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSI14RDYF</name><description>HSI14 ready interrupt flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSI48RDYF</name><description>HSI48 ready interrupt flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CSSF</name><description>Clock Security System Interrupt               flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSIRDYIE</name><description>LSI Ready Interrupt Enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDYIE</name><description>LSE Ready Interrupt Enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDYIE</name><description>HSI Ready Interrupt Enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDYIE</name><description>HSE Ready Interrupt Enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDYIE</name><description>PLL Ready Interrupt Enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSI14RDYE</name><description>HSI14 ready interrupt               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSI48RDYIE</name><description>HSI48 ready interrupt               enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDYC</name><description>LSI Ready Interrupt Clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSERDYC</name><description>LSE Ready Interrupt Clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSIRDYC</name><description>HSI Ready Interrupt Clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSERDYC</name><description>HSE Ready Interrupt Clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLRDYC</name><description>PLL Ready Interrupt Clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSI14RDYC</name><description>HSI 14 MHz Ready Interrupt               Clear</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSI48RDYC</name><description>HSI48 Ready Interrupt               Clear</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CSSC</name><description>Clock security system interrupt               clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field></fields></register><register><name>APB2RSTR</name><displayName>APB2RSTR</displayName><description>APB2 peripheral reset register           (RCC_APB2RSTR)</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SYSCFGRST</name><description>SYSCFG and COMP reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCRST</name><description>ADC interface reset</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1RST</name><description>TIM1 timer reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1RST</name><description>SPI 1 reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1RST</name><description>USART1 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM16RST</name><description>TIM16 timer reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM17RST</name><description>TIM17 timer reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>DBGMCURST</name><description>Debug MCU reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1RSTR</name><displayName>APB1RSTR</displayName><description>APB1 peripheral reset register           (RCC_APB1RSTR)</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM2RST</name><description>Timer 2 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3RST</name><description>Timer 3 reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM14RST</name><description>Timer 14 reset</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGRST</name><description>Window watchdog reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2RST</name><description>SPI2 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2RST</name><description>USART 2 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1RST</name><description>I2C1 reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>USBRST</name><description>USB interface reset</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CANRST</name><description>CAN interface reset</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CRSRST</name><description>Clock Recovery System interface               reset</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>PWRRST</name><description>Power interface reset</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>CECRST</name><description>HDMI CEC reset</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHBENR</name><displayName>AHBENR</displayName><description>AHB Peripheral Clock enable register           (RCC_AHBENR)</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000014</resetValue><fields><field><name>DMAEN</name><description>DMA1 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAMEN</name><description>SRAM interface clock               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FLITFEN</name><description>FLITF clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>CRC clock enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPAEN</name><description>I/O port A clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPBEN</name><description>I/O port B clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPCEN</name><description>I/O port C clock enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPFEN</name><description>I/O port F clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TSCEN</name><description>Touch sensing controller clock               enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2ENR</name><displayName>APB2ENR</displayName><description>APB2 peripheral clock enable register           (RCC_APB2ENR)</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SYSCFGEN</name><description>SYSCFG clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCEN</name><description>ADC 1 interface clock               enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1EN</name><description>TIM1 Timer clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1EN</name><description>SPI 1 clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1EN</name><description>USART1 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM16EN</name><description>TIM16 timer clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM17EN</name><description>TIM17 timer clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>DBGMCUEN</name><description>MCU debug module clock               enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1ENR</name><displayName>APB1ENR</displayName><description>APB1 peripheral clock enable register           (RCC_APB1ENR)</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM2EN</name><description>Timer 2 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3EN</name><description>Timer 3 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM14EN</name><description>Timer 14 clock enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGEN</name><description>Window watchdog clock               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2EN</name><description>SPI 2 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2EN</name><description>USART 2 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1EN</name><description>I2C 1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>USBRST</name><description>USB interface clock enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CANEN</name><description>CAN interface clock enable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CRSEN</name><description>Clock Recovery System interface clock               enable</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>PWREN</name><description>Power interface clock               enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>DACEN</name><description>DAC interface clock enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CECEN</name><description>HDMI CEC interface clock               enable</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BDCR</name><displayName>BDCR</displayName><description>Backup domain control register           (RCC_BDCR)</description><addressOffset>0x20</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>LSEON</name><description>External Low Speed oscillator               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDY</name><description>External Low Speed oscillator               ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSEBYP</name><description>External Low Speed oscillator               bypass</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSEDRV</name><description>LSE oscillator drive               capability</description><bitOffset>3</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>RTCSEL</na