MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
me><description>RTC clock source selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>RTCEN</name><description>RTC clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BDRST</name><description>Backup domain software               reset</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>Control/status register           (RCC_CSR)</description><addressOffset>0x24</addressOffset><size>0x20</size><resetValue>0x0C000000</resetValue><fields><field><name>LSION</name><description>Internal low speed oscillator               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDY</name><description>Internal low speed oscillator               ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RMVF</name><description>Remove reset flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OBLRSTF</name><description>Option byte loader reset               flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINRSTF</name><description>PIN reset flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PORRSTF</name><description>POR/PDR reset flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SFTRSTF</name><description>Software reset flag</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IWDGRSTF</name><description>Independent watchdog reset               flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGRSTF</name><description>Window watchdog reset flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LPWRRSTF</name><description>Low-power reset flag</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHBRSTR</name><displayName>AHBRSTR</displayName><description>AHB peripheral reset register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IOPARST</name><description>I/O port A reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPBRST</name><description>I/O port B reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPCRST</name><description>I/O port C reset</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPFRST</name><description>I/O port F reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TSCRST</name><description>Touch sensing controller               reset</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFGR2</name><displayName>CFGR2</displayName><description>Clock configuration register 2</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PREDIV</name><description>PREDIV division factor</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CFGR3</name><displayName>CFGR3</displayName><description>Clock configuration register 3</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>USART1SW</name><description>USART1 clock source               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>I2C1SW</name><description>I2C1 clock source               selection</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CECSW</name><description>HDMI CEC clock source               selection</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>USBSW</name><description>USB clock source selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCSW</name><description>ADC clock source selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2SW</name><description>USART2 clock source               selection</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>Clock control register 2</description><addressOffset>0x34</addressOffset><size>0x20</size><resetValue>0x00000080</resetValue><fields><field><name>HSI14ON</name><description>HSI14 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSI14RDY</name><description>HR14 clock ready flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSI14DIS</name><description>HSI14 clock request from ADC               disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSI14TRIM</name><description>HSI14 clock trimming</description><bitOffset>3</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>HSI14CAL</name><description>HSI14 clock calibration</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>HSI48ON</name><description>HSI48 clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSI48RDY</name><description>HSI48 clock ready flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSI48CAL</name><description>HSI48 factory clock               calibration</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral><name>SYSCFG</name><description>System configuration controller</description><groupName>SYSCFG</groupName><baseAddress>0x40010000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>CFGR1</name><displayName>CFGR1</displayName><description>configuration register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM_MODE</name><description>Memory mapping selection               bits</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>ADC_DMA_RMP</name><description>ADC DMA remapping bit</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1_TX_DMA_RMP</name><description>USART1_TX DMA remapping               bit</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1_RX_DMA_RMP</name><description>USART1_RX DMA request remapping               bit</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM16_DMA_RMP</name><description>TIM16 DMA request remapping               bit</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM17_DMA_RMP</name><description>TIM17 DMA request remapping               bit</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB6_FM</name><description>Fast Mode Plus (FM plus) driving capability               activation bits.</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB7_FM</name><description>Fast Mode Plus (FM+) driving capability               activation bits.</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB8_FM</name><description>Fast Mode Plus (FM+) driving capability               activation bits.</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C_PB9_FM</name><description>Fast Mode Plus (FM+) driving capability               activation bits.</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1_FM_plus</name><description>FM+ driving capability activation for               I2C1</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2_FM_plus</name><description>FM+ driving capability activation for               I2C2</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2_DMA_RMP</name><description>SPI2 DMA request remapping               bit</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2_DMA_RMP</name><description>USART2 DMA request remapping               bit</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>USART3_DMA_RMP</name><description>USART3 DMA request remapping               bit</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1_DMA_RMP</name><description>I2C1 DMA request remapping               bit</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1_DMA_RMP</name><description>TIM1 DMA request remapping               bit</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM2_DMA_RMP</name><description>TIM2 DMA request remapping               bit</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3_DMA_RMP</name><description>TIM3 DMA request remapping               bit</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EXTICR1</name><displayName>EXTICR1</displayName><description>external interrupt configuration register           1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI3</name><description>EXTI 3 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI2</name><description>EXTI 2 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI1</name><description>EXTI 1 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI0</name><description>EXTI 0 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR2</name><displayName>EXTICR2</displayName><description>external interrupt configuration register           2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI7</name><description>EXTI 7 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI6</name><description>EXTI 6 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI5</name><description>EXTI 5 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI4</name><description>EXTI 4 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR3</name><displayName>EXTICR3</displayName><description>external interrupt configuration register           3</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI11</name><description>EXTI 11 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI10</name><description>EXTI 10 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI9</name><description>EXTI 9 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI8</name><description>EXTI 8 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR4</name><displayName>EXTICR4</displayName><description>external interrupt configuration register           4</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI15</name><description>EXTI 15 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI14</name><description>EXTI 14 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI13</name><description>EXTI 13 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI12</name><description>EXTI 12 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CFGR2</name><displayName>CFGR2</displayName><description>configuration register 2</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>SRAM_PEF</name><description>SRAM parity flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PVD_LOCK</name><description>PVD lock enable bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAM_PARITY_LOCK</name><description>SRAM parity lock bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LOCUP_LOCK</name><description>Cortex-M0 LOCKUP bit enable               bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>ADC</name><description>Analog-to-digital converter</description><groupName>ADC</groupName><baseAddress>0x40012400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>ADC_COMP</name><description>ADC and comparator interrupts</description><value>12</value></interrupt><interrupt><name>ADC_COMP</name><description>ADC and comparator interrupts</description><value>12</value></interrupt><registers><register><name>ISR</name><displayName>ISR</displayName><description>interrupt and status register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AWD</name><description>Analog watchdog flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OVR</name><description>ADC overrun</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EOS</name><description>End of sequence flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EOC</name><description>End of conversion flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSMP</name><description>End of sampling flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADRDY</name><description>ADC ready</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IER</name><displayName>IER</displayName><description>interrupt enable register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AWDIE</name><description>Analog watchdog interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OVRIE</name><description>Overrun interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSIE</name><description>End of conversion sequence interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>EOCIE</name><description>End of conversion interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EOSMPIE</name><description>End of sampling flag interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADRDYIE</name><description>ADC ready interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ADCAL</name><description>ADC calibration</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>ADSTP</name><description>ADC stop conversion               command</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ADSTART</name><description>ADC start conversion               command</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ADDIS</name><description>ADC disable command</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADEN</name><description>ADC enable command</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFGR1</name><displayName>CFGR1</displayName><description>configuration register 1</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AWDCH</name><description>Analog watchdog channel               selection</description><bitOffset>26</bitOffset><bitWidth>5</bitWidth></field><field><name>AWDEN</name><description>Analog watchdog enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>AWDSGL</name><description>Enable the watchdog on a single channel               or on all channels</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>DISCEN</name><description>Discontinuous mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTOFF</name><description>Auto-off mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTDLY</name><description>Auto-delayed conversion               mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CONT</name><description>Single / continuous conversion               mode</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>OVRMOD</name><description>Overrun management mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTEN</name><description>External trigger enable and polarity               selection</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTSEL</name><description>External trigger selection</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>ALIGN</name><description>Data alignment</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>RES</name><description>Data resolution</description><bitOffset>3</bitOffset><bitWidth>2</bitWidth></field><field><name>SCANDIR</name><description>Scan sequence direction</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DMACFG</name><description>Direct memery access               configuration</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN</name><description>Direct memory access               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFGR2</name><displayName>CFGR2</displayName><description>configuration register 2</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00008000</resetValue><fields><field><name>JITOFF_D4</name><description>JITOFF_D4</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>JITOFF_D2</name><description>JITOFF_D2</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SMPR</name><displayName>SMPR</displayName><description>sampling time register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SMPR</name><description>Sampling time selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>TR</name><displayName>TR</displayName><description>watchdog threshold register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000FFF</resetValue><fields><field><name>HT</name><description>Analog watchdog higher               threshold</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>LT</name><description>Analog watchdog lower               threshold</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>CHSELR</name><displayName>CHSELR</displayName><description>channel selection register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CHSEL18</name><description>Channel-x selection</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL17</name><description>Channel-x selection</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL16</name><description>Channel-x selection</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL15</name><description>Channel-x selection</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL14</name><description>Channel-x selection</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL13</name><description>Channel-x selection</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL12</name><description>Channel-x selection</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL11</name><description>Channel-x selection</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL10</name><description>Channel-x selection</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL9</name><description>Channel-x selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL8</name><description>Channel-x selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL7</name><description>Channel-x selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL6</name><description>Channel-x selection</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL5</name><description>Channel-x selection</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL4</name><description>Channel-x selection</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL3</name><description>Channel-x selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL2</name><description>Channel-x selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL1</name><description>Channel-x selection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CHSEL0</name><description>Channel-x selection</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields