MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
></register><register><name>DR</name><displayName>DR</displayName><description>data register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA</name><description>Converted data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR</name><displayName>CCR</displayName><description>common configuration register</description><addressOffset>0x308</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>VBATEN</name><description>VBAT enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>TSEN</name><description>Temperature sensor enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>VREFEN</name><description>Temperature sensor and VREFINT               enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>USART1</name><description>Universal synchronous asynchronous receiver       transmitter</description><groupName>USART</groupName><baseAddress>0x40013800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>USART1</name><description>USART1 global interrupt</description><value>27</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>Control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>UE</name><description>USART enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>UESM</name><description>USART enable in Stop mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>RE</name><description>Receiver enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TE</name><description>Transmitter enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IDLEIE</name><description>IDLE interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNEIE</name><description>RXNE interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transmission complete interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXEIE</name><description>interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PEIE</name><description>PE interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PS</name><description>Parity selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>PCE</name><description>Parity control enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>WAKE</name><description>Receiver wakeup method</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>M</name><description>Word length</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MME</name><description>Mute mode enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CMIE</name><description>Character match interrupt               enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>OVER8</name><description>Oversampling mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>DEDT</name><description>Driver Enable deassertion               time</description><bitOffset>16</bitOffset><bitWidth>5</bitWidth></field><field><name>DEAT</name><description>Driver Enable assertion               time</description><bitOffset>21</bitOffset><bitWidth>5</bitWidth></field><field><name>RTOIE</name><description>Receiver timeout interrupt               enable</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>EOBIE</name><description>End of Block interrupt               enable</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>M1</name><description>Word length</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>Control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ADD4</name><description>Address of the USART node</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field><field><name>ADD0</name><description>Address of the USART node</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>RTOEN</name><description>Receiver timeout enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>ABRMOD</name><description>Auto baud rate mode</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth></field><field><name>ABREN</name><description>Auto baud rate enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>MSBFIRST</name><description>Most significant bit first</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>DATAINV</name><description>Binary data inversion</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TXINV</name><description>TX pin active level               inversion</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>RXINV</name><description>RX pin active level               inversion</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>SWAP</name><description>Swap TX/RX pins</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LINEN</name><description>LIN mode enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>STOP bits</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>CLKEN</name><description>Clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LBCL</name><description>Last bit clock pulse</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDIE</name><description>LIN break detection interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDL</name><description>LIN break detection length</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ADDM7</name><description>7-bit Address Detection/4-bit Address               Detection</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR3</name><displayName>CR3</displayName><description>Control register 3</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>WUFIE</name><description>Wakeup from Stop mode interrupt               enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>WUS</name><description>Wakeup from Stop mode interrupt flag               selection</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>SCARCNT</name><description>Smartcard auto-retry count</description><bitOffset>17</bitOffset><bitWidth>3</bitWidth></field><field><name>DEP</name><description>Driver enable polarity               selection</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>DEM</name><description>Driver enable mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>DDRE</name><description>DMA Disable on Reception               Error</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>OVRDIS</name><description>Overrun Disable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ONEBIT</name><description>One sample bit method               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSIE</name><description>CTS interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSE</name><description>CTS enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RTSE</name><description>RTS enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAT</name><description>DMA enable transmitter</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAR</name><description>DMA enable receiver</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>SCEN</name><description>Smartcard mode enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NACK</name><description>Smartcard NACK enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HDSEL</name><description>Half-duplex selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IRLP</name><description>IrDA low-power</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IREN</name><description>IrDA mode enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EIE</name><description>Error interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BRR</name><displayName>BRR</displayName><description>Baud rate register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DIV_Mantissa</name><description>mantissa of USARTDIV</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>DIV_Fraction</name><description>fraction of USARTDIV</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>GTPR</name><displayName>GTPR</displayName><description>Guard time and prescaler           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>GT</name><description>Guard time value</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RTOR</name><displayName>RTOR</displayName><description>Receiver timeout register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>BLEN</name><description>Block Length</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>RTO</name><description>Receiver timeout value</description><bitOffset>0</bitOffset><bitWidth>24</bitWidth></field></fields></register><register><name>RQR</name><displayName>RQR</displayName><description>Request register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TXFRQ</name><description>Transmit data flush               request</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>RXFRQ</name><description>Receive data flush request</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>MMRQ</name><description>Mute mode request</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SBKRQ</name><description>Send break request</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ABRRQ</name><description>Auto baud rate request</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ISR</name><displayName>ISR</displayName><description>Interrupt &amp; status           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00C0</resetValue><fields><field><name>REACK</name><description>Receive enable acknowledge               flag</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TEACK</name><description>Transmit enable acknowledge               flag</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>WUF</name><description>Wakeup from Stop mode flag</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>RWU</name><description>Receiver wakeup from Mute               mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>SBKF</name><description>Send break flag</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CMF</name><description>character match flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>BUSY</name><description>Busy flag</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>ABRF</name><description>Auto baud rate flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ABRE</name><description>Auto baud rate error</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>EOBF</name><description>End of block flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>RTOF</name><description>Receiver timeout</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CTS</name><description>CTS flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSIF</name><description>CTS interrupt flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDF</name><description>LIN break detection flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TXE</name><description>Transmit data register               empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TC</name><description>Transmission complete</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNE</name><description>Read data register not               empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>IDLE</name><description>Idle line detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ORE</name><description>Overrun error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NF</name><description>Noise detected flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FE</name><description>Framing error</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PE</name><description>Parity error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ICR</name><displayName>ICR</displayName><description>Interrupt flag clear register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>WUCF</name><description>Wakeup from Stop mode clear               flag</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CMCF</name><description>Character match clear flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EOBCF</name><description>End of timeout clear flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>RTOCF</name><description>Receiver timeout clear               flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSCF</name><description>CTS clear flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDCF</name><description>LIN break detection clear               flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TCCF</name><description>Transmission complete clear               flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>IDLECF</name><description>Idle line detected clear               flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ORECF</name><description>Overrun error clear flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NCF</name><description>Noise detected clear flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FECF</name><description>Framing error clear flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PECF</name><description>Parity error clear flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RDR</name><displayName>RDR</displayName><description>Receive data register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>RDR</name><description>Receive data value</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field></fields></register><register><name>TDR</name><displayName>TDR</displayName><description>Transmit data register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TDR</name><description>Transmit data value</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="USART1"><name>USART2</name><baseAddress>0x40004400</baseAddress><interrupt><name>USART2</name><description>USART2 global interrupt</description><value>28</value></interrupt></peripheral><peripheral><name>COMP</name><description>Comparator</description><groupName>COMP</groupName><baseAddress>0x4001001C</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>CSR</name><displayName>CSR</displayName><description>control and status register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP1EN</name><description>Comparator 1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP1_INP_DAC</name><description>COMP1_INP_DAC</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP1MODE</name><description>Comparator 1 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP1INSEL</name><description>Comparator 1 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP1OUTSEL</name><description>Comparator 1 output               selection</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP1POL</name><description>Comparator 1 output               polarity</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP1HYST</name><description>Comparator 1 hysteresis</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP1OUT</name><description>Comparator 1 output</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP1LOCK</name><description>Comparator 1 lock</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2EN</name><description>Comparator 2 enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2MODE</name><description>Comparator 2 mode</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP2INSEL</name><description>Comparator 2 inverting input               selection</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>WNDWEN</name><description>Window mode enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2OUTSEL</name><description>Comparator 2 output               selection</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP2POL</name><description>Comparator 2 output               polarity</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2HYST</name><description>Comparator 2 hysteresis</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP2OUT</name><description>Comparator 2 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP2LOCK</name><description>Comparator 2 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>RTC</name><description>Real-time clock</description><groupName>RTC</groupName><baseAddress>0x40002800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RTC</name><description>RTC interrupts</description><value>2</value></interrupt><registers><register><name>TR</name><displayName>TR</displayName><description>time register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PM</name><description>AM/PM notation</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>HT</name><description>Hour tens in BCD format</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>HU</name><description>Hour units in BCD format</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>MNT</name><description>Minute tens in BCD format</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>MNU</name><description>Minute units in BCD format</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>ST</name><description>Second tens in BCD format</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>SU</name><description>Second units in BCD format</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>date register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00002101</resetValue><fields><field><name>YT</name><description>Year tens in BCD format</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>YU</name><description>Year units in BCD format</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>WDU</name><description>Week day units</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth></field><field><name>MT</name><description>Month tens in BCD format</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MU</name><description>Month units in BCD format</description><bitOffset>8</bitOffset><bitWidth>4</bitW