MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
idth></field><field><name>DT</name><description>Date tens in BCD format</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DU</name><description>Date units in BCD format</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>TSEDGE</name><description>Time-stamp event active               edge</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>REFCKON</name><description>RTC_REFIN reference clock detection               enable (50 or 60 Hz)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BYPSHAD</name><description>Bypass the shadow               registers</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMT</name><description>Hour format</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRAE</name><description>Alarm A enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSE</name><description>timestamp enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRAIE</name><description>Alarm A interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSIE</name><description>Time-stamp interrupt               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADD1H</name><description>Add 1 hour (summer time               change)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>SUB1H</name><description>Subtract 1 hour (winter time               change)</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>BKP</name><description>Backup</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COSEL</name><description>Calibration output               selection</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>POL</name><description>Output polarity</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OSEL</name><description>Output selection</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COE</name><description>Calibration output enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ISR</name><displayName>ISR</displayName><description>initialization and status           register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000007</resetValue><fields><field><name>ALRAWF</name><description>Alarm A write flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SHPF</name><description>Shift operation pending</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INITS</name><description>Initialization status flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RSF</name><description>Registers synchronization               flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>INITF</name><description>Initialization flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INIT</name><description>Initialization mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRAF</name><description>Alarm A flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSF</name><description>Time-stamp flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TSOVF</name><description>Time-stamp overflow flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TAMP1F</name><description>RTC_TAMP1 detection flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TAMP2F</name><description>RTC_TAMP2 detection flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RECALPF</name><description>Recalibration pending Flag</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>PRER</name><displayName>PRER</displayName><description>prescaler register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x007F00FF</resetValue><fields><field><name>PREDIV_A</name><description>Asynchronous prescaler               factor</description><bitOffset>16</bitOffset><bitWidth>7</bitWidth></field><field><name>PREDIV_S</name><description>Synchronous prescaler               factor</description><bitOffset>0</bitOffset><bitWidth>15</bitWidth></field></fields></register><register><name>ALRMAR</name><displayName>ALRMAR</displayName><description>alarm A register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MSK4</name><description>Alarm A date mask</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>WDSEL</name><description>Week day selection</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>DT</name><description>Date tens in BCD format.</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth></field><field><name>DU</name><description>Date units or day in BCD               format.</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>MSK3</name><description>Alarm A hours mask</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>PM</name><description>AM/PM notation</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>HT</name><description>Hour tens in BCD format.</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>HU</name><description>Hour units in BCD format.</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>MSK2</name><description>Alarm A minutes mask</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MNT</name><description>Minute tens in BCD format.</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>MNU</name><description>Minute units in BCD               format.</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>MSK1</name><description>Alarm A seconds mask</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ST</name><description>Second tens in BCD format.</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>SU</name><description>Second units in BCD               format.</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>WPR</name><displayName>WPR</displayName><description>write protection register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>KEY</name><description>Write protection key</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>SSR</name><displayName>SSR</displayName><description>sub second register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>SS</name><description>Sub second value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>SHIFTR</name><displayName>SHIFTR</displayName><description>shift control register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>ADD1S</name><description>Reserved</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>SUBFS</name><description>Subtract a fraction of a               second</description><bitOffset>0</bitOffset><bitWidth>15</bitWidth></field></fields></register><register><name>TSTR</name><displayName>TSTR</displayName><description>timestamp time register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>PM</name><description>AM/PM notation</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>HT</name><description>Hour tens in BCD format.</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>HU</name><description>Hour units in BCD format.</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>MNT</name><description>Minute tens in BCD format.</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>MNU</name><description>Minute units in BCD               format.</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>ST</name><description>Second tens in BCD format.</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>SU</name><description>Second units in BCD               format.</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TSDR</name><displayName>TSDR</displayName><description>timestamp date register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>WDU</name><description>Week day units</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth></field><field><name>MT</name><description>Month tens in BCD format</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MU</name><description>Month units in BCD format</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>DT</name><description>Date tens in BCD format</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DU</name><description>Date units in BCD format</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TSSSR</name><displayName>TSSSR</displayName><description>time-stamp sub second register</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>SS</name><description>Sub second value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CALR</name><displayName>CALR</displayName><description>calibration register</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CALP</name><description>Use an 8-second calibration cycle               period</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CALW8</name><description>Use a 16-second calibration cycle               period</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CALW16</name><description>Reserved</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CALM</name><description>Calibration minus</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field></fields></register><register><name>TAFCR</name><displayName>TAFCR</displayName><description>tamper and alternate function configuration           register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PC15MODE</name><description>PC15 mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>PC15VALUE</name><description>PC15 value</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>PC14MODE</name><description>PC14 mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>PC14VALUE</name><description>PC14 value</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>PC13MODE</name><description>PC13 mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>PC13VALUE</name><description>RTC_ALARM output type/PC13               value</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TAMP_PUDIS</name><description>RTC_TAMPx pull-up disable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TAMP_PRCH</name><description>RTC_TAMPx precharge               duration</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>TAMPFLT</name><description>RTC_TAMPx filter count</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>TAMPFREQ</name><description>Tamper sampling frequency</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth></field><field><name>TAMPTS</name><description>Activate timestamp on tamper detection               event</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TAMP2_TRG</name><description>Active level for RTC_TAMP2               input</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TAMP2E</name><description>RTC_TAMP2 input detection               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TAMPIE</name><description>Tamper interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TAMP1TRG</name><description>Active level for RTC_TAMP1               input</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TAMP1E</name><description>RTC_TAMP1 input detection               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ALRMASSR</name><displayName>ALRMASSR</displayName><description>alarm A sub second register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MASKSS</name><description>Mask the most-significant bits starting               at this bit</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>SS</name><description>Sub seconds value</description><bitOffset>0</bitOffset><bitWidth>15</bitWidth></field></fields></register><register><name>BKP0R</name><displayName>BKP0R</displayName><description>backup register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP1R</name><displayName>BKP1R</displayName><description>backup register</description><addressOffset>0x54</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP2R</name><displayName>BKP2R</displayName><description>backup register</description><addressOffset>0x58</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP3R</name><displayName>BKP3R</displayName><description>backup register</description><addressOffset>0x5C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP4R</name><displayName>BKP4R</displayName><description>backup register</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>TIM16</name><description>General-purpose-timers</description><groupName>TIM</groupName><baseAddress>0x40014400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM16</name><description>TIM16 global interrupt</description><value>21</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CKD</name><description>Clock division</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>ARPE</name><description>Auto-reload preload enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OPM</name><description>One-pulse mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>URS</name><description>Update request source</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UDIS</name><description>Update disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CEN</name><description>Counter enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>OIS1N</name><description>Output Idle state 1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS1</name><description>Output Idle state 1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CCDS</name><description>Capture/compare DMA               selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CCUS</name><description>Capture/compare control update               selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CCPC</name><description>Capture/compare preloaded               control</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DIER</name><displayName>DIER</displayName><description>DMA/Interrupt enable register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TDE</name><description>Trigger DMA request enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1DE</name><description>Capture/Compare 1 DMA request               enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>UDE</name><description>Update DMA request enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BIE</name><description>Break interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TIE</name><description>Trigger interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>COMIE</name><description>COM interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IE</name><description>Capture/Compare 1 interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIE</name><description>Update interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC1OF</name><description>Capture/Compare 1 overcapture               flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BIF</name><description>Break interrupt flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TIF</name><description>Trigger interrupt flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>COMIF</name><description>COM interrupt flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IF</name><description>Capture/compare 1 interrupt               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIF</name><description>Update interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EGR</name><displayName>EGR</displayName><description>event generation register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x0000</resetValue><fields><field><name>BG</name><description>Break generation</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TG</name><description>Trigger generation</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>COMG</name><description>Capture/Compare control update               generation</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1G</name><description>Capture/compare 1               generation</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UG</name><description>Update generation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCMR1_Output</name><displayName>CCMR1_Output</displayName><description>capture/compare mode register (output           mode)</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OC1M</name><description>Output Compare 1 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC1PE</name><description>Output Compare 1 preload               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1FE</name><description>Output Compare 1 fast               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCMR1_Input</name><displayName>CCMR1_Input</displayName><description>capture/compare mode register 1 (input           mode)</description><alternateRegister>CCMR1_Output</alternateRegister><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IC1F</name><description>Input capture 1 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>IC1PSC</name><description>Input capture 1 prescaler</description><bitOffset>2</bitOffset><