MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
bitWidth>2</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCER</name><displayName>CCER</displayName><description>capture/compare enable           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC1NP</name><description>Capture/Compare 1 output               Polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1NE</name><description>Capture/Compare 1 complementary output               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1P</name><description>Capture/Compare 1 output               Polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1E</name><description>Capture/Compare 1 output               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNT</name><displayName>CNT</displayName><description>counter</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>counter value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PSC</name><displayName>PSC</displayName><description>prescaler</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ARR</name><displayName>ARR</displayName><description>auto-reload register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ARR</name><description>Auto-reload value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>RCR</name><displayName>RCR</displayName><description>repetition counter register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>REP</name><description>Repetition counter value</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CCR1</name><displayName>CCR1</displayName><description>capture/compare register 1</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR1</name><description>Capture/Compare 1 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>BDTR</name><displayName>BDTR</displayName><description>break and dead-time register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>MOE</name><description>Main output enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>AOE</name><description>Automatic output enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BKP</name><description>Break polarity</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BKE</name><description>Break enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>OSSR</name><description>Off-state selection for Run               mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OSSI</name><description>Off-state selection for Idle               mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>LOCK</name><description>Lock configuration</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>DTG</name><description>Dead-time generator setup</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DCR</name><displayName>DCR</displayName><description>DMA control register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DBL</name><description>DMA burst length</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field><field><name>DBA</name><description>DMA base address</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>DMAR</name><displayName>DMAR</displayName><description>DMA address for full transfer</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DMAB</name><description>DMA register for burst               accesses</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="TIM16"><name>TIM17</name><baseAddress>0x40014800</baseAddress><interrupt><name>TIM17</name><description>TIM17 global interrupt</description><value>22</value></interrupt></peripheral><peripheral><name>TSC</name><description>Touch sensing controller</description><groupName>TSC</groupName><baseAddress>0x40024000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TSC</name><description>Touch sensing interrupt</description><value>8</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CTPH</name><description>Charge transfer pulse high</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field><field><name>CTPL</name><description>Charge transfer pulse low</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>SSD</name><description>Spread spectrum deviation</description><bitOffset>17</bitOffset><bitWidth>7</bitWidth></field><field><name>SSE</name><description>Spread spectrum enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>SSPSC</name><description>Spread spectrum prescaler</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>PGPSC</name><description>pulse generator prescaler</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>MCV</name><description>Max count value</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>IODEF</name><description>I/O Default mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SYNCPOL</name><description>Synchronization pin               polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>AM</name><description>Acquisition mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>START</name><description>Start a new acquisition</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TSCE</name><description>Touch sensing controller               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IER</name><displayName>IER</displayName><description>interrupt enable register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MCEIE</name><description>Max count error interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EOAIE</name><description>End of acquisition interrupt               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ICR</name><displayName>ICR</displayName><description>interrupt clear register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MCEIC</name><description>Max count error interrupt               clear</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EOAIC</name><description>End of acquisition interrupt               clear</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ISR</name><displayName>ISR</displayName><description>interrupt status register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MCEF</name><description>Max count error flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EOAF</name><description>End of acquisition flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IOHCR</name><displayName>IOHCR</displayName><description>I/O hysteresis control           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>G6_IO4</name><description>G6_IO4 Schmitt trigger hysteresis               mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO3</name><description>G6_IO3 Schmitt trigger hysteresis               mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO2</name><description>G6_IO2 Schmitt trigger hysteresis               mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO1</name><description>G6_IO1 Schmitt trigger hysteresis               mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO4</name><description>G5_IO4 Schmitt trigger hysteresis               mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO3</name><description>G5_IO3 Schmitt trigger hysteresis               mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO2</name><description>G5_IO2 Schmitt trigger hysteresis               mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO1</name><description>G5_IO1 Schmitt trigger hysteresis               mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO4</name><description>G4_IO4 Schmitt trigger hysteresis               mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO3</name><description>G4_IO3 Schmitt trigger hysteresis               mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO2</name><description>G4_IO2 Schmitt trigger hysteresis               mode</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO1</name><description>G4_IO1 Schmitt trigger hysteresis               mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO4</name><description>G3_IO4 Schmitt trigger hysteresis               mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO3</name><description>G3_IO3 Schmitt trigger hysteresis               mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO2</name><description>G3_IO2 Schmitt trigger hysteresis               mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO1</name><description>G3_IO1 Schmitt trigger hysteresis               mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO4</name><description>G2_IO4 Schmitt trigger hysteresis               mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO3</name><description>G2_IO3 Schmitt trigger hysteresis               mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO2</name><description>G2_IO2 Schmitt trigger hysteresis               mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO1</name><description>G2_IO1 Schmitt trigger hysteresis               mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO4</name><description>G1_IO4 Schmitt trigger hysteresis               mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO3</name><description>G1_IO3 Schmitt trigger hysteresis               mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO2</name><description>G1_IO2 Schmitt trigger hysteresis               mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO1</name><description>G1_IO1 Schmitt trigger hysteresis               mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IOASCR</name><displayName>IOASCR</displayName><description>I/O analog switch control           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>G6_IO4</name><description>G6_IO4 analog switch               enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO3</name><description>G6_IO3 analog switch               enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO2</name><description>G6_IO2 analog switch               enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO1</name><description>G6_IO1 analog switch               enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO4</name><description>G5_IO4 analog switch               enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO3</name><description>G5_IO3 analog switch               enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO2</name><description>G5_IO2 analog switch               enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO1</name><description>G5_IO1 analog switch               enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO4</name><description>G4_IO4 analog switch               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO3</name><description>G4_IO3 analog switch               enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO2</name><description>G4_IO2 analog switch               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO1</name><description>G4_IO1 analog switch               enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO4</name><description>G3_IO4 analog switch               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO3</name><description>G3_IO3 analog switch               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO2</name><description>G3_IO2 analog switch               enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO1</name><description>G3_IO1 analog switch               enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO4</name><description>G2_IO4 analog switch               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO3</name><description>G2_IO3 analog switch               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO2</name><description>G2_IO2 analog switch               enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO1</name><description>G2_IO1 analog switch               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO4</name><description>G1_IO4 analog switch               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO3</name><description>G1_IO3 analog switch               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO2</name><description>G1_IO2 analog switch               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO1</name><description>G1_IO1 analog switch               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IOSCR</name><displayName>IOSCR</displayName><description>I/O sampling control register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>G6_IO4</name><description>G6_IO4 sampling mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO3</name><description>G6_IO3 sampling mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO2</name><description>G6_IO2 sampling mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO1</name><description>G6_IO1 sampling mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO4</name><description>G5_IO4 sampling mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO3</name><description>G5_IO3 sampling mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO2</name><description>G5_IO2 sampling mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO1</name><description>G5_IO1 sampling mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO4</name><description>G4_IO4 sampling mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO3</name><description>G4_IO3 sampling mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO2</name><description>G4_IO2 sampling mode</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO1</name><description>G4_IO1 sampling mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO4</name><description>G3_IO4 sampling mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO3</name><description>G3_IO3 sampling mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO2</name><description>G3_IO2 sampling mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO1</name><description>G3_IO1 sampling mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO4</name><description>G2_IO4 sampling mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO3</name><description>G2_IO3 sampling mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO2</name><description>G2_IO2 sampling mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO1</name><description>G2_IO1 sampling mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO4</name><description>G1_IO4 sampling mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO3</name><description>G1_IO3 sampling mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO2</name><description>G1_IO2 sampling mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO1</name><description>G1_IO1 sampling mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IOCCR</name><displayName>IOCCR</displayName><description>I/O channel control register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>G6_IO4</name><description>G6_IO4 channel mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO3</name><description>G6_IO3 channel mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO2</name><description>G6_IO2 channel mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>G6_IO1</name><description>G6_IO1 channel mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO4</name><description>G5_IO4 channel mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO3</name><description>G5_IO3 channel mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO2</name><description>G5_IO2 channel mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>G5_IO1</name><description>G5_IO1 channel mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO4</name><description>G4_IO4 channel mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO3</name><description>G4_IO3 channel mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO2</name><description>G4_IO2 channel mode</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>G4_IO1</name><description>G4_IO1 channel mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO4</name><description>G3_IO4 channel mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO3</name><description>G3_IO3 channel mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO2</name><description>G3_IO2 channel mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>G3_IO1</name><description>G3_IO1 channel mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO4</name><description>G2_IO4 channel mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO3</name><description>G2_IO3 channel mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO2</name><description>G2_IO2 channel mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>G2_IO1</name><description>G2_IO1 channel mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO4</name><description>G1_IO4 channel mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO3</name><description>G1_IO3 channel mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO2</name><description>G1_IO2 channel mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>G1_IO1</name><description>G1_IO1 channel mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IOGCSR</name><displayName>IOGCSR</displayName><description>I/O group control status           register</description><addressOffset>0x30</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>G8S</name><description>Analog I/O group x status</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>r