MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
ead-write</access></field><field><name>G7S</name><description>Analog I/O group x status</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G6S</name><description>Analog I/O group x status</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>G5S</name><description>Analog I/O group x status</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>G4S</name><description>Analog I/O group x status</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>G3S</name><description>Analog I/O group x status</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>G2S</name><description>Analog I/O group x status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>G1S</name><description>Analog I/O group x status</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>G8E</name><description>Analog I/O group x enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G7E</name><description>Analog I/O group x enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G6E</name><description>Analog I/O group x enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G5E</name><description>Analog I/O group x enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G4E</name><description>Analog I/O group x enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G3E</name><description>Analog I/O group x enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G2E</name><description>Analog I/O group x enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>G1E</name><description>Analog I/O group x enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>IOG1CR</name><displayName>IOG1CR</displayName><description>I/O group x counter register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG2CR</name><displayName>IOG2CR</displayName><description>I/O group x counter register</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG3CR</name><displayName>IOG3CR</displayName><description>I/O group x counter register</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG4CR</name><displayName>IOG4CR</displayName><description>I/O group x counter register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG5CR</name><displayName>IOG5CR</displayName><description>I/O group x counter register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register><register><name>IOG6CR</name><displayName>IOG6CR</displayName><description>I/O group x counter register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Counter value</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field></fields></register></registers></peripheral><peripheral><name>CEC</name><description>HDMI-CEC controller</description><groupName>CEC</groupName><baseAddress>0x40007800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>CEC_CAN</name><description>CEC and CAN global interrupt</description><value>30</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TXEOM</name><description>Tx End Of Message</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TXSOM</name><description>Tx start of message</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CECEN</name><description>CEC Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CFGR</name><displayName>CFGR</displayName><description>configuration register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LBPEGEN</name><description>Generate Error-Bit on Long Bit Period               Error</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BREGEN</name><description>Generate error-bit on bit rising               error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BRESTP</name><description>Rx-stop on bit rising               error</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RXTOL</name><description>Rx-Tolerance</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>SFT</name><description>Signal Free Time</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>LSTN</name><description>Listen mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>OAR</name><description>Own Address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TXDR</name><displayName>TXDR</displayName><description>Tx data register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>TXD</name><description>Tx Data register</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RXDR</name><displayName>RXDR</displayName><description>Rx Data Register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>RXDR</name><description>CEC Rx Data Register</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>ISR</name><displayName>ISR</displayName><description>Interrupt and Status Register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TXACKE</name><description>Tx-Missing acknowledge               error</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERR</name><description>Tx-Error</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TXUDR</name><description>Tx-Buffer Underrun</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TXEND</name><description>End of Transmission</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TXBR</name><description>Tx-Byte Request</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ARBLST</name><description>Arbitration Lost</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>RXACKE</name><description>Rx-Missing Acknowledge</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LBPE</name><description>Rx-Long Bit Period Error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>SBPE</name><description>Rx-Short Bit period error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BRE</name><description>Rx-Bit rising error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>RXOVR</name><description>Rx-Overrun</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RXEND</name><description>End Of Reception</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>RXBR</name><description>Rx-Byte Received</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IER</name><displayName>IER</displayName><description>interrupt enable register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TXACKIE</name><description>Tx-Missing Acknowledge Error Interrupt               Enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TXERRIE</name><description>Tx-Error Interrupt Enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TXUDRIE</name><description>Tx-Underrun interrupt               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TXENDIE</name><description>Tx-End of message interrupt               enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TXBRIE</name><description>Tx-Byte Request Interrupt               Enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ARBLSTIE</name><description>Arbitration Lost Interrupt               Enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>RXACKIE</name><description>Rx-Missing Acknowledge Error Interrupt               Enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LBPEIE</name><description>Long Bit Period Error Interrupt               Enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>SBPEIE</name><description>Short Bit Period Error Interrupt               Enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BREIE</name><description>Bit Rising Error Interrupt               Enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>RXOVRIE</name><description>Rx-Buffer Overrun Interrupt               Enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RXENDIE</name><description>End Of Reception Interrupt               Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>RXBRIE</name><description>Rx-Byte Received Interrupt               Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>Flash</name><description>Flash</description><groupName>Flash</groupName><baseAddress>0x40022000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>FLASH</name><description>Flash global interrupt</description><value>3</value></interrupt><registers><register><name>ACR</name><displayName>ACR</displayName><description>Flash access control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000030</resetValue><fields><field><name>LATENCY</name><description>LATENCY</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PRFTBE</name><description>PRFTBE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PRFTBS</name><description>PRFTBS</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>KEYR</name><displayName>KEYR</displayName><description>Flash key register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>FKEYR</name><description>Flash Key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OPTKEYR</name><displayName>OPTKEYR</displayName><description>Flash option key register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>OPTKEYR</name><description>Option byte key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Flash status register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EOP</name><description>End of operation</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WRPRT</name><description>Write protection error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGERR</name><description>Programming error</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BSY</name><description>Busy</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>Flash control register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000080</resetValue><fields><field><name>FORCE_OPTLOAD</name><description>Force option byte loading</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>EOPIE</name><description>End of operation interrupt               enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTWRE</name><description>Option bytes write enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LOCK</name><description>Lock</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>STRT</name><description>Start</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTER</name><description>Option byte erase</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTPG</name><description>Option byte programming</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>MER</name><description>Mass erase</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PER</name><description>Page erase</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PG</name><description>Programming</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AR</name><displayName>AR</displayName><description>Flash address register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>FAR</name><description>Flash address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OBR</name><displayName>OBR</displayName><description>Option byte register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x03FFFFF2</resetValue><fields><field><name>Data1</name><description>Data1</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>Data0</name><description>Data0</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>VDDA_MONITOR</name><description>VDDA_MONITOR</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BOOT1</name><description>BOOT1</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>nRST_STDBY</name><description>nRST_STDBY</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>nRST_STOP</name><description>nRST_STOP</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>WDG_SW</name><description>WDG_SW</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LEVEL2_PROT</name><description>Level 2 protection status</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>LEVEL1_PROT</name><description>Level 1 protection status</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTERR</name><description>Option byte error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>WRPR</name><displayName>WRPR</displayName><description>Write protection register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-only</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>WRP</name><description>Write protect</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DBGMCU</name><description>Debug support</description><groupName>DBGMCU</groupName><baseAddress>0x40015800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>IDCODE</name><displayName>IDCODE</displayName><description>MCU Device ID Code Register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0</resetValue><fields><field><name>DEV_ID</name><description>Device Identifier</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>DIV_ID</name><description>Division Identifier</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>REV_ID</name><description>Revision Identifier</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>Debug MCU Configuration           Register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBG_STOP</name><description>Debug Stop Mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_STANDBY</name><description>Debug Standby Mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APBLFZ</name><displayName>APBLFZ</displayName><description>APB Low Freeze Register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBG_TIMER2_STOP</name><description>Debug Timer 2 stopped when Core is               halted</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIMER3_STOP</name><description>Debug Timer 3 stopped when Core is               halted</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIMER6_STOP</name><description>Debug Timer 6 stopped when Core is               halted</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIMER14_STOP</name><description>Debug Timer 14 stopped when Core is               halted</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_RTC_STOP</name><description>Debug RTC stopped when Core is               halted</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_WWDG_STOP</name><description>Debug Window Wachdog stopped when Core               is halted</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_IWDG_STOP</name><description>Debug Independent Wachdog stopped when               Core is halted</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1_SMBUS_TIMEOUT</name><description>SMBUS timeout mode stopped when Core is               halted</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APBHFZ</name><displayName>APBHFZ</displayName><description>APB High Freeze Register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBG_TIMER1_STOP</name><description>Debug Timer 1 stopped when Core is               halted</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIMER15_STO</name><description>Debug Timer 15 stopped when Core is               halted</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIMER16_STO</name><description>Debug Timer 16 stopped when Core is               halted</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>DBG_TIMER17_STO</name><description>Debug Timer 17 stopped when Core is               halted</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>USB</name><description>Universal serial bus full-speed device       interface</description><groupName>USB</groupName><baseAddress>0x40005C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>EP0R</name><displayName>EP0R</displayName><description>endpoint 0 register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><