MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
><description>Expected SYNC flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRF</name><description>Error flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SYNCWARNF</name><description>SYNC warning flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SYNCOKF</name><description>SYNC event OK flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ICR</name><displayName>ICR</displayName><description>interrupt flag clear register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ESYNCC</name><description>Expected SYNC clear flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRC</name><description>Error clear flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SYNCWARNC</name><description>SYNC warning clear flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SYNCOKC</name><description>SYNC event OK clear flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>CAN</name><description>Controller area network</description><groupName>CAN</groupName><baseAddress>0x40006400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>USB</name><description>USB global interrupt</description><value>31</value></interrupt><registers><register><name>CAN_MCR</name><displayName>CAN_MCR</displayName><description>CAN_MCR</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DBF</name><description>DBF</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>RESET</name><description>RESET</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TTCM</name><description>TTCM</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ABOM</name><description>ABOM</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>AWUM</name><description>AWUM</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NART</name><description>NART</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>RFLM</name><description>RFLM</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TXFP</name><description>TXFP</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SLEEP</name><description>SLEEP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>INRQ</name><description>INRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_MSR</name><displayName>CAN_MSR</displayName><description>CAN_MSR</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RX</name><description>RX</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SAMP</name><description>SAMP</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXM</name><description>RXM</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXM</name><description>TXM</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SLAKI</name><description>SLAKI</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUI</name><description>WKUI</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRI</name><description>ERRI</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLAK</name><description>SLAK</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INAK</name><description>INAK</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CAN_TSR</name><displayName>CAN_TSR</displayName><description>CAN_TSR</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>LOW2</name><description>Lowest priority flag for mailbox               2</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW1</name><description>Lowest priority flag for mailbox               1</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW0</name><description>Lowest priority flag for mailbox               0</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME2</name><description>Lowest priority flag for mailbox               2</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME1</name><description>Lowest priority flag for mailbox               1</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME0</name><description>Lowest priority flag for mailbox               0</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CODE</name><description>CODE</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>ABRQ2</name><description>ABRQ2</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR2</name><description>TERR2</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST2</name><description>ALST2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK2</name><description>TXOK2</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP2</name><description>RQCP2</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ1</name><description>ABRQ1</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR1</name><description>TERR1</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST1</name><description>ALST1</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK1</name><description>TXOK1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP1</name><description>RQCP1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ0</name><description>ABRQ0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR0</name><description>TERR0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST0</name><description>ALST0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK0</name><description>TXOK0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP0</name><description>RQCP0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CAN_RF0R</name><displayName>CAN_RF0R</displayName><description>CAN_RF0R</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RFOM0</name><description>RFOM0</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR0</name><description>FOVR0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FULL0</name><description>FULL0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMP0</name><description>FMP0</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>CAN_RF1R</name><displayName>CAN_RF1R</displayName><description>CAN_RF1R</description><addressOffset>0x10</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RFOM1</name><description>RFOM1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR1</name><description>FOVR1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FULL1</name><description>FULL1</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMP1</name><description>FMP1</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>CAN_IER</name><displayName>CAN_IER</displayName><description>CAN_IER</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SLKIE</name><description>SLKIE</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>WKUIE</name><description>WKUIE</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>ERRIE</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LECIE</name><description>LECIE</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFIE</name><description>BOFIE</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EPVIE</name><description>EPVIE</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>EWGIE</name><description>EWGIE</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FOVIE1</name><description>FOVIE1</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FFIE1</name><description>FFIE1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FMPIE1</name><description>FMPIE1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FOVIE0</name><description>FOVIE0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FFIE0</name><description>FFIE0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FMPIE0</name><description>FMPIE0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TMEIE</name><description>TMEIE</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_ESR</name><displayName>CAN_ESR</displayName><description>CAN_ESR</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>REC</name><description>REC</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>TEC</name><description>TEC</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>LEC</name><description>LEC</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>BOFF</name><description>BOFF</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPVF</name><description>EPVF</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWGF</name><description>EWGF</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CAN_BTR</name><displayName>CAN_BTR</displayName><description>CAN_BTR</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SILM</name><description>SILM</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>LBKM</name><description>LBKM</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>SJW</name><description>SJW</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>TS2</name><description>TS2</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field><field><name>TS1</name><description>TS1</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>BRP</name><description>BRP</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register><register><name>CAN_TI0R</name><displayName>CAN_TI0R</displayName><description>CAN_TI0R</description><addressOffset>0x180</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_TDT0R</name><displayName>CAN_TDT0R</displayName><description>CAN_TDT0R</description><addressOffset>0x184</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CAN_TDL0R</name><displayName>CAN_TDL0R</displayName><description>CAN_TDL0R</description><addressOffset>0x188</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_TDH0R</name><displayName>CAN_TDH0R</displayName><description>CAN_TDH0R</description><addressOffset>0x18C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_TI1R</name><displayName>CAN_TI1R</displayName><description>CAN_TI1R</description><addressOffset>0x190</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_TDT1R</name><displayName>CAN_TDT1R</displayName><description>CAN_TDT1R</description><addressOffset>0x194</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CAN_TDL1R</name><displayName>CAN_TDL1R</displayName><description>CAN_TDL1R</description><addressOffset>0x198</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_TDH1R</name><displayName>CAN_TDH1R</displayName><description>CAN_TDH1R</description><addressOffset>0x19C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_TI2R</name><displayName>CAN_TI2R</displayName><description>CAN_TI2R</description><addressOffset>0x1A0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_TDT2R</name><displayName>CAN_TDT2R</displayName><description>CAN_TDT2R</description><addressOffset>0x1A4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CAN_TDL2R</name><displayName>CAN_TDL2R</displayName><description>CAN_TDL2R</description><addressOffset>0x1A8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_TDH2R</name><displayName>CAN_TDH2R</displayName><description>CAN_TDH2R</description><addressOffset>0x1AC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_RI0R</name><displayName>CAN_RI0R</displayName><description>CAN_RI0R</description><addressOffset>0x1B0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_RDT0R</name><displayName>CAN_RDT0R</displayName><description>CAN_RDT0R</description><addressOffset>0x1B4</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>FMI</name><description>FMI</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CAN_RDL0R</name><displayName>CAN_RDL0R</displayName><description>CAN_RDL0R</description><addressOffset>0x1B8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_RDH0R</name><displayName>CAN_RDH0R</displayName><description>CAN_RDH0R</description><addressOffset>0x1BC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></field