MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
s></register><register><name>CAN_RI1R</name><displayName>CAN_RI1R</displayName><description>CAN_RI1R</description><addressOffset>0x1C0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_RDT1R</name><displayName>CAN_RDT1R</displayName><description>CAN_RDT1R</description><addressOffset>0x1C4</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>FMI</name><description>FMI</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CAN_RDL1R</name><displayName>CAN_RDL1R</displayName><description>CAN_RDL1R</description><addressOffset>0x1C8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_RDH1R</name><displayName>CAN_RDH1R</displayName><description>CAN_RDH1R</description><addressOffset>0x1CC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CAN_FMR</name><displayName>CAN_FMR</displayName><description>CAN_FMR</description><addressOffset>0x200</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CAN2SB</name><description>CAN2SB</description><bitOffset>8</bitOffset><bitWidth>6</bitWidth></field><field><name>FINIT</name><description>FINIT</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_FM1R</name><displayName>CAN_FM1R</displayName><description>CAN_FM1R</description><addressOffset>0x204</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FBM0</name><description>Filter mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM1</name><description>Filter mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM2</name><description>Filter mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM3</name><description>Filter mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM4</name><description>Filter mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM5</name><description>Filter mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM6</name><description>Filter mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM7</name><description>Filter mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM8</name><description>Filter mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM9</name><description>Filter mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM10</name><description>Filter mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM11</name><description>Filter mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM12</name><description>Filter mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM13</name><description>Filter mode</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM14</name><description>Filter mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM15</name><description>Filter mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM16</name><description>Filter mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM17</name><description>Filter mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM18</name><description>Filter mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM19</name><description>Filter mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM20</name><description>Filter mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM21</name><description>Filter mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM22</name><description>Filter mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM23</name><description>Filter mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM24</name><description>Filter mode</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM25</name><description>Filter mode</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM26</name><description>Filter mode</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM27</name><description>Filter mode</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_FS1R</name><displayName>CAN_FS1R</displayName><description>CAN_FS1R</description><addressOffset>0x20C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FSC0</name><description>Filter scale configuration</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC1</name><description>Filter scale configuration</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC2</name><description>Filter scale configuration</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC3</name><description>Filter scale configuration</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC4</name><description>Filter scale configuration</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC5</name><description>Filter scale configuration</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC6</name><description>Filter scale configuration</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC7</name><description>Filter scale configuration</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC8</name><description>Filter scale configuration</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC9</name><description>Filter scale configuration</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC10</name><description>Filter scale configuration</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC11</name><description>Filter scale configuration</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC12</name><description>Filter scale configuration</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC13</name><description>Filter scale configuration</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC14</name><description>Filter scale configuration</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC15</name><description>Filter scale configuration</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC16</name><description>Filter scale configuration</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC17</name><description>Filter scale configuration</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC18</name><description>Filter scale configuration</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC19</name><description>Filter scale configuration</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC20</name><description>Filter scale configuration</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC21</name><description>Filter scale configuration</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC22</name><description>Filter scale configuration</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC23</name><description>Filter scale configuration</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC24</name><description>Filter scale configuration</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC25</name><description>Filter scale configuration</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC26</name><description>Filter scale configuration</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC27</name><description>Filter scale configuration</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_FFA1R</name><displayName>CAN_FFA1R</displayName><description>CAN_FFA1R</description><addressOffset>0x214</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FFA0</name><description>Filter FIFO assignment for filter               0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA1</name><description>Filter FIFO assignment for filter               1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA2</name><description>Filter FIFO assignment for filter               2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA3</name><description>Filter FIFO assignment for filter               3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA4</name><description>Filter FIFO assignment for filter               4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA5</name><description>Filter FIFO assignment for filter               5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA6</name><description>Filter FIFO assignment for filter               6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA7</name><description>Filter FIFO assignment for filter               7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA8</name><description>Filter FIFO assignment for filter               8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA9</name><description>Filter FIFO assignment for filter               9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA10</name><description>Filter FIFO assignment for filter               10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA11</name><description>Filter FIFO assignment for filter               11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA12</name><description>Filter FIFO assignment for filter               12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA13</name><description>Filter FIFO assignment for filter               13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA14</name><description>Filter FIFO assignment for filter               14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA15</name><description>Filter FIFO assignment for filter               15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA16</name><description>Filter FIFO assignment for filter               16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA17</name><description>Filter FIFO assignment for filter               17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA18</name><description>Filter FIFO assignment for filter               18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA19</name><description>Filter FIFO assignment for filter               19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA20</name><description>Filter FIFO assignment for filter               20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA21</name><description>Filter FIFO assignment for filter               21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA22</name><description>Filter FIFO assignment for filter               22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA23</name><description>Filter FIFO assignment for filter               23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA24</name><description>Filter FIFO assignment for filter               24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA25</name><description>Filter FIFO assignment for filter               25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA26</name><description>Filter FIFO assignment for filter               26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FFA27</name><description>Filter FIFO assignment for filter               27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CAN_FA1R</name><displayName>CAN_FA1R</displayName><description>CAN_FA1R</description><addressOffset>0x21C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FACT0</name><description>Filter active</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT1</name><description>Filter active</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT2</name><description>Filter active</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT3</name><description>Filter active</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT4</name><description>Filter active</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT5</name><description>Filter active</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT6</name><description>Filter active</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT7</name><description>Filter active</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT8</name><description>Filter active</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT9</name><description>Filter active</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT10</name><description>Filter active</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT11</name><description>Filter active</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT12</name><description>Filter active</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT13</name><description>Filter active</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT14</name><description>Filter active</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT15</name><description>Filter active</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT16</name><description>Filter active</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT17</name><description>Filter active</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT18</name><description>Filter active</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT19</name><description>Filter active</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT20</name><description>Filter active</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT21</name><description>Filter active</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT22</name><description>Filter active</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT23</name><description>Filter active</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT24</name><description>Filter active</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT25</name><description>Filter active</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT26</name><description>Filter active</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FACT27</name><description>Filter active</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F0R1</name><displayName>F0R1</displayName><description>Filter bank 0 register 1</description><addressOffset>0x240</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>F0R2</name><displayName>F0R2</displayName><description>Filter bank 0 register 2</description><addressOffset>0x244</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description