MaJerle/stm32f429/00-STM32_SVD/STM32F042x.svd
set><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral></peripherals></device>